Catalogs/УчетныеЗаписиЭлектронныхТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиЭлектронныхТорговыхПлощадок</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЭТП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЭлектронныхТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеДанныхРегистрации</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеНастроекКомпоновкиДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/УчетныеЗаписиЭлектронныхТорговыхПлощадок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает доступную учетную запись в случае, если она является единственной в справочнике.
// В случае отсутствия записей или наличия более одной возвращается пустая ссылка.
//
// Параметры:
//   ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - вид электронной торговой площадки для получения учетной записи.
//
// Возвращаемое значение:
//   СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись по-умолчанию.
//
Функция ОсновнаяУчетнаяЗапись(ВидЭТП) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
    	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
    	|	УчетныеЗаписиЭТП.Ссылка КАК УчетнаяЗапись
    	|ИЗ
    	|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписиЭТП
    	|ГДЕ
    	|	УчетныеЗаписиЭТП.ВидЭТП = &ВидЭТП
    	|	И НЕ УчетныеЗаписиЭТП.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ВидЭТП", ВидЭТП);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок.ПустаяСсылка");
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Количество() = 2 Тогда
		Возврат ПредопределенноеЗначение("Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок.ПустаяСсылка");
	КонецЕсли;

	Выборка.Следующий();
	Возврат Выборка.УчетнаяЗапись;

КонецФункции

// Возвращает количество подключений к электронной торговой площадке.
//
// Параметры:
//   ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - вид электронной торговой площадки.
// 
// Возвращаемое значение:
//   Число - количество подключений.
//
Функция КоличествоПодключений(ВидЭТП) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЭТП", ВидЭТП);
	Запрос.Текст =
    	"ВЫБРАТЬ
    	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УчетныеЗаписиЭТП.Ссылка), 0) КАК КоличествоПодключений
    	|ИЗ
    	|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписиЭТП
    	|ГДЕ
    	|	УчетныеЗаписиЭТП.ВидЭТП = &ВидЭТП
    	|	И НЕ УчетныеЗаписиЭТП.ПометкаУдаления";

	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат 0; 
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();

	Возврат Выборка.КоличествоПодключений;

КонецФункции

// Возвращает результат проверки существования доступной учетной записи.
//
// Параметры:
//   ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - вид электронной торговой площадки.
// 
// Возвращаемое значение:
//   Булево - результат проверки существования доступной учетной записи.
//
Функция ЕстьДоступнаяУчетнаяЗапись(ВидЭТП) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЭТП", ВидЭТП);
	Запрос.Текст =
    	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
    	|	УчетныеЗаписиЭТП.Ссылка
    	|ИЗ
    	|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписиЭТП
    	|ГДЕ
    	|	УчетныеЗаписиЭТП.ВидЭТП = &ВидЭТП
    	|	И НЕ УчетныеЗаписиЭТП.ПометкаУдаления";

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();

КонецФункции

// Получение актуальной учетной записи организации
// 
// Параметры:
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - вид электронной торговой площадки. 
//  Организация - ОпределяемыйТип.Организация - Организация
// 
// Возвращаемое значение:
//   СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись ЭТП
//
Функция УчетнаяЗаписьОрганизации(ВидЭТП, Организация) Экспорт
	
	Если Не ПравоДоступа("Чтение", Метаданные.Справочники.УчетныеЗаписиЭлектронныхТорговыхПлощадок) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	УчетныеЗаписиЭТП.Ссылка КАК УчетнаяЗапись
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписиЭТП
	|ГДЕ
	|	УчетныеЗаписиЭТП.Организация = &Организация
	|	И УчетныеЗаписиЭТП.ВидЭТП = &ВидЭТП
	|	И НЕ УчетныеЗаписиЭТП.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ВидЭТП", ВидЭТП);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.УчетнаяЗапись;
	
КонецФункции

// Проверяет актуальность учетной записи
// 
// Параметры:
//  УчетнаяЗапись - СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - проверяемая учетная запись
//  ВидЭТП - ПеречислениеСсылка.ВидыЭлектронныхТорговыхПлощадок - этп в которой проверяется актуальность учетной записи
// 
// Возвращаемое значение:
//   СправочникСсылка.УчетныеЗаписиЭлектронныхТорговыхПлощадок - учетная запись ЭТП
//
Функция УчетнаяЗаписьАктуальна(УчетнаяЗапись, ВидЭТП) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Истина КАК УчетнаяЗаписьАктуальна
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписиЭТП
	|ГДЕ
	|	УчетныеЗаписиЭТП.Ссылка = &УчетнаяЗапись
	|	И УчетныеЗаписиЭТП.ВидЭТП = &ВидЭТП
	|	И НЕ УчетныеЗаписиЭТП.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("УчетнаяЗапись", УчетнаяЗапись);
	Запрос.УстановитьПараметр("ВидЭТП", ВидЭТП);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Регистрирует данные к обновлению в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПараметрыВыборки = Параметры.ПараметрыВыборки;
	ПараметрыВыборки.ПолныеИменаОбъектов = "Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок";
	ПараметрыВыборки.ПоляУпорядочиванияПриРаботеПользователей.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.ПоляУпорядочиванияПриОбработкеДанных.Добавить("Ссылка УБЫВ");
	ПараметрыВыборки.СпособВыборки = ОбновлениеИнформационнойБазы.СпособВыборкиСсылки();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	УчетныеЗаписи.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок КАК УчетныеЗаписи
	|ГДЕ
	|	УчетныеЗаписи.ВидЭТП В (ЗНАЧЕНИЕ(Перечисление.ВидыЭлектронныхТорговыхПлощадок.БидзаарПоставщики), 
	|		ЗНАЧЕНИЕ(Перечисление.ВидыЭлектронныхТорговыхПлощадок.БидзаарПокупатели))
	|	И УчетныеЗаписи.Сервер = """"";
	
	Результат = Запрос.Выполнить().Выгрузить();
	МассивСсылок = Результат.ВыгрузитьКолонку("Ссылка");
	
	ОбновлениеИнформационнойБазы.ОтметитьКОбработке(Параметры, МассивСсылок);

КонецПроцедуры

// Обрабатывает данные, зарегистрированные в плане обмена ОбновлениеИнформационнойБазы
//  см. Стандарты и методики разработки прикладных решений: Параллельный режим отложенного обновления.
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке.
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок";
	
	ОбновляемыеДанные = ОбновлениеИнформационнойБазы.ДанныеДляОбновленияВМногопоточномОбработчике(Параметры);
	Если ОбновляемыеДанные.Количество() = 0 Тогда
		Параметры.ОбработкаЗавершена =
			ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
		Возврат;
	КонецЕсли;
	
	ИменаРабочихСерверов = ИнтеграцияСЭлектроннымиТорговымиПлощадкамиКлиентСервер.ИменаСерверовБидзаар(Истина, Ложь);
	Если ИменаРабочихСерверов.Количество() > 0 Тогда
		ИмяРабочегоСервера = ИменаРабочихСерверов[0].Значение;
	Иначе
		ИмяРабочегоСервера = "bidzaar.com";
	КонецЕсли;
	
	ПроблемныхОбъектов = 0;
	ОбъектовОбработано = 0;
	
	УчетныеЗаписиОрганизаций = Новый Соответствие;
	
	Для Каждого Выборка Из ОбновляемыеДанные Цикл
		
		НачатьТранзакцию();
		Попытка
		
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("Справочник.УчетныеЗаписиЭлектронныхТорговыхПлощадок");
			ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
			Блокировка.Заблокировать();
			
			СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();	// СправочникОбъект.УчетныеЗаписиЭлектронныхТорговыхПлощадок
			СправочникОбъект.Сервер = ИмяРабочегоСервера;
			
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СправочникОбъект);
			
			ВладелецЗаписиХранилища = СтрШаблон("%1%2", 
				ИнтеграцияСЭлектроннымиТорговымиПлощадками.ПрефиксыСервиса(СправочникОбъект.ВидЭТП).КлючДоступа,
				XMLСтрока(СправочникОбъект.Ссылка));
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ВладелецЗаписиХранилища, Неопределено, "КлючДоступа");
			
			ОбъектовОбработано = ОбъектовОбработано + 1;
			
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			ПроблемныхОбъектов = ПроблемныхОбъектов + 1;
			
			ОбновлениеИнформационнойБазы.ЗаписатьОшибкуВЖурналРегистрации(
				Выборка.Ссылка, Строка(Выборка.Ссылка), ИнформацияОбОшибке());
		КонецПопытки;
		
	КонецЦикла;
	
	Параметры.ОбработкаЗавершена = ОбновлениеИнформационнойБазы.ОбработкаДанныхЗавершена(Параметры.Очередь, ПолноеИмяОбъекта);
	Если ОбъектовОбработано = 0 И ПроблемныхОбъектов <> 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Не удалось обработать некоторые учетные записи (пропущены): %1'"),
				ПроблемныхОбъектов);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
